"""
Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент
к заданному числу X. Пользователь в первой строке вводит натуральное число
N – количество элементов в массиве. В последующих строках записаны
N целых чисел Ai. Последняя строка содержит число X

n = 5
1 2 3 4 5
x = 6
-> 5
"""

n = int(input('Введите размер списка: '))
a = list(range(1, n+1))
x=int(input('Введите число x: '))
b=[abs(a[i]-x) for i in range(len(a))]
print("n = ",n)
print(*a)
print("x = ",x)
print("-> ",a[b.index(min(b))])